import xgboost as xgb
import numpy as np
import gurobipy as gb
from gurobi_ml import add_predictor_constr
import _13_nodes_distribution_network as H
import time
import json

def extract_leaves_from_tree_array(tree, n_features):
    """
    适用于 split_indices 格式
    """

    split_indices = tree["split_indices"]
    split_conditions = tree["split_conditions"]
    left_children = tree["left_children"]
    right_children = tree["right_children"]
    base_weights = tree["base_weights"]  # 叶子值

    leaves = []

    def dfs(nid, lower, upper):
        # ========= 判断叶子 =========
        if left_children[nid] == -1:
            value = base_weights[nid]
            leaves.append((lower.copy(), upper.copy(), value))
            return

        # ========= 取 split =========
        f = split_indices[nid]
        thresh = split_conditions[nid]

        # ========= 左子树（≤）=========
        new_upper = upper.copy()
        new_upper[f] = min(new_upper[f], thresh-0.005)
        dfs(left_children[nid], lower, new_upper)

        # ========= 右子树（>）=========
        new_lower = lower.copy()
        new_lower[f] = max(new_lower[f], thresh)
        dfs(right_children[nid], new_lower, upper)

    # 初始区间
    lower0 = np.full(n_features, 0.0)
    upper0 = np.full(n_features,  2.0)

    dfs(0, lower0, upper0)  # 根节点通常是0

    return leaves

def load_xgb_json(model_path):
    with open(model_path, "r") as f:
        model = json.load(f)
    return model

def extract_all_trees(model_json, n_features):
    trees = []

    for tree in model_json["learner"]["gradient_booster"]["model"]["trees"]:

        leaves = extract_leaves_from_tree_array(tree, n_features)
        trees.append(leaves)
    base_score=float(model_json["learner"]["learner_model_param"]["base_score"][1:-1])
    return trees,base_score




# 1. 加载已训练好的模型
# 支持 .json, .ubj, .bst 等格式 [citation:2][citation:9]
model = xgb.Booster()
model.load_model('../XGBoost_main/model1.json')  # 替换成你的模型路径
dd=[[0,0,0,1,0,0,1,1,0,1,0,0,1,1,0,1,1,1,0,0,0,1,1,1,1,0,0,0,0,0,1,1,0,0,0,0,0,0,1,0,1,0,1,1,0,0,0,0.2,18991.45572],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,0,1,1,1,0,0,0,1,1,1,1,0,0,0,0,0,1,1,0,0,0,0,0,0,1,0,1,0,1,1,0,0,0,0.1,14566.06733],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,0,1,1,1,0,0,0,1,1,1,1,0,0,0,0,0,1,1,0,0,0,0,0,0,1,0,1,0,1,1,0,0,0.1,0.2,17380.53408],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,0,1,1,1,0,0,0,1,1,1,1,0,0,0,0,0,1,1,0,0,0,0,0,0,1,0,1,0,1,1,0,0,0.1,0.1,13026.53298],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,1,1,0,0,0,1,0,0,1,1,1,0,0,1,0,0,0,0,1,0,0,1,1,0,0,0,0,1,0,1,0,0.2,23909.87817],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,1,1,0,0,0,1,0,0,1,1,1,0,0,1,0,0,0,0,1,0,0,1,1,0,0,0,0,1,0,1,0,0.1,23878.16072],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,1,1,0,0,0,1,0,0,1,1,1,0,0,1,0,0,0,0,1,0,0,1,1,0,0,0,0,1,0,1,0.1,0.2,24914.70745],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,1,1,0,0,0,1,0,0,1,1,1,0,0,1,0,0,0,0,1,0,0,1,1,0,0,0,0,1,0,1,0.1,0.1,25463.91952],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,0,1,0,1,0,1,1,1,1,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,1,0,1,0,0.2,26017.45459],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,0,1,0,1,0,1,1,1,1,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,1,0,1,0,0.1,26701.34001],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,0,1,0,1,0,1,1,1,1,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,1,0,1,0.1,0.2,28811.68836],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,0,1,0,1,0,1,1,1,1,0,1,0,0,1,0,0,0,0,0,0,0,0,0,0,1,1,1,1,0,1,0,1,0.1,0.1,30693.7746],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,1,0,0,1,0,1,0,0,0,1,0,1,0,0,1,0,0,0,0,1,0,1,1,1,1,1,0,0,0,1,0,0.2,15645.74726],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,1,0,0,1,0,1,0,0,0,1,0,1,0,0,1,0,0,0,0,1,0,1,1,1,1,1,0,0,0,1,0,0.1,12278.39373],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,1,0,0,1,0,1,0,0,0,1,0,1,0,0,1,0,0,0,0,1,0,1,1,1,1,1,0,0,0,1,0.1,0.2,12128.06269],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,0,0,0,0,1,1,0,1,1,1,1,1,1,0,0,0,0,0,0,1,0,0,0,1,0,0,1,0,0,1,1,1,0,0.1,12780.18951],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,0,0,0,0,1,1,0,1,1,1,1,1,1,0,0,0,0,0,0,1,0,0,0,1,0,0,1,0,0,1,1,1,0.1,0.2,12561.27643],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,0,0,0,0,1,1,0,1,1,1,1,1,1,0,0,0,0,0,0,1,0,0,0,1,0,0,1,0,0,1,1,1,0.1,0.1,7715.064653],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,0,0,0,1,1,0,0,1,1,0,1,1,1,0,0,0,0,1,1,0,0,0,0,0,0,0,1,1,1,1,1,1,0,0.1,12511.94398],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,0,0,0,1,1,0,0,1,1,0,1,1,1,0,0,0,0,1,1,0,0,0,0,0,0,0,1,1,1,1,1,1,0.1,0.2,12266.88701],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,0,0,0,1,1,0,0,1,1,0,1,1,1,0,0,0,0,1,1,0,0,0,0,0,0,0,1,1,1,1,1,1,0.1,0.1,7464.98374],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,0,1,0,0,1,0,0,1,0,0,0,0,1,0,0,1,1,1,1,0,1,0,0,0,0,1,0,1,1,1,0,1,1,0,0.1,12937.54082],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,0,1,0,0,1,0,0,1,0,0,0,0,1,0,0,1,1,1,1,0,1,0,0,0,0,1,0,1,1,1,0,1,1,0.1,0.2,12714.8584],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,0,1,0,0,1,0,0,1,0,0,0,0,1,0,0,1,1,1,1,0,1,0,0,0,0,1,0,1,1,1,0,1,1,0.1,0.1,5871.2967],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,0,1,0,1,1,0,1,1,1,0,0,0,0,0,0,1,0,1,0,0,1,1,0,0,0,0,1,1,1,1,0,0.1,12231.15918],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,0,1,0,1,1,0,1,1,1,0,0,0,0,0,0,1,0,1,0,0,1,1,0,0,0,0,1,1,1,1,0.1,0.2,12347.07511],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,0,1,0,1,1,0,1,1,1,0,0,0,0,0,0,1,0,1,0,0,1,1,0,0,0,0,1,1,1,1,0.1,0.1,7820.852054],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,0,0,1,0,0,0,1,0,0,1,1,1,0,1,1,0,1,0,0,0,1,1,0,1,0,1,0,0,1,0,1,0,0.2,15788.94184],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,0,0,1,0,0,0,1,0,0,1,1,1,0,1,1,0,1,0,0,0,1,1,0,1,0,1,0,0,1,0,1,0,0.1,12364.7178],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,0,0,1,0,0,0,1,0,0,1,1,1,0,1,1,0,1,0,0,0,1,1,0,1,0,1,0,0,1,0,1,0.1,0.2,12147.57713],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,0,0,1,0,0,0,1,0,0,1,1,1,0,1,1,0,1,0,0,0,1,1,0,1,0,1,0,0,1,0,1,0.1,0.1,7624.041636],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,1,0,0,1,0,0,0,1,0,0,1,0,0,0,0,1,1,1,0,0,0,0,1,0,1,1,1,0,1,1,0,0.2,15742.87458],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,1,0,0,1,0,0,0,1,0,0,1,0,0,0,0,1,1,1,0,0,0,0,1,0,1,1,1,0,1,1,0.1,0.2,12167.81441],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,1,0,0,1,0,0,0,1,0,0,1,0,0,0,0,1,1,1,0,0,0,0,1,0,1,1,1,0,1,1,0.1,0.1,7730.954524],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,0,1,0,1,0,0,0,0,0,1,1,0,1,1,0,1,0,0,1,1,0,1,1,0,0,0,0,0,0,1,1,0,0,0,0.1,13078.20754],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,0,1,0,1,0,0,0,0,0,1,1,0,1,1,0,1,0,0,1,1,0,1,1,0,0,0,0,0,0,1,1,0,0,0.1,0.2,12991.55629],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,0,1,0,1,0,0,0,0,0,1,1,0,1,1,0,1,0,0,1,1,0,1,1,0,0,0,0,0,0,1,1,0,0,0.1,0.1,8116.525215],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,0,1,0,1,0,1,0,1,0,0,1,0,0,0,0,1,1,1,0,0,1,0,1,0,1,1,0,0,0,1,0,0.2,15580.21478],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,0,1,0,1,0,1,0,1,0,0,1,0,0,0,0,1,1,1,0,0,1,0,1,0,1,1,0,0,0,1,0,0.1,12236.40576],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,1,1,1,0,1,0,1,0,1,0,1,0,0,1,0,0,0,0,1,1,1,0,0,1,0,1,0,1,1,0,0,0,1,0.1,0.2,12008.28778],
    [0,0,0,1,0,0,1,1,0,1,0,0,1,0,0,1,1,0,1,0,0,0,0,0,0,1,0,1,0,0,1,1,1,0,0,0,1,0,0,0,1,0,1,0,1,1,0,0.1,13434.52274]]
input_data = np.array([[row[:-1] for row in dd][0]])
print(input_data)# 示例: 一行5个特征
prediction = model.predict(xgb.DMatrix(input_data))
print(f"预测结果: {prediction}")
d=[row[:-1] for row in dd][0]
m=gb.Model('Grid_planning')
S={}
for i in range(H.n):
    S[i]=m.addVar(vtype=gb.GRB.BINARY, name=f"S_{i}")
# 定义支路投建变量
U = {}
for i, j in H.Branch:
    U[(i, j)] = m.addVar(vtype=gb.GRB.BINARY, name=f"U_{i}_{j}")
mu=m.addVar(vtype=gb.GRB.CONTINUOUS, name="mu")
eps=m.addVar(vtype=gb.GRB.CONTINUOUS, name="eps")
input_vars = []
for i in H.nodes:
    input_vars.append(S[i])
for i, j in H.Branch:
    input_vars.append(U[(i, j)])
input_vars.append(mu)
input_vars.append(eps)
for i in range(len(input_vars)):
    m.addConstr(input_vars[i]==d[i])

fop=m.addVar(lb=-gb.GRB.INFINITY)
#===========================================================================
def load_biggs(m,fop):
    start_time = time.time()
    model_json1 = load_xgb_json("model1.json")
    # model_json2 = load_xgb_json("model2.json")

    n_features = 48

    trees1, base_score = extract_all_trees(model_json1, n_features)
    # trees2 = extract_all_trees(model_json1, n_features)
    y_total1 = m.addVar(lb=-gb.GRB.INFINITY, name="y1")
    # y_total2 = m.addVar(lb=-gb.GRB.INFINITY, name="y2")
    y_trees1 = []
    # y_trees2 = []

    # ========= 每棵树 =========
    for t, leaves in enumerate(trees1):

        Len = len(leaves)

        # z变量
        z = m.addVars(Len, vtype=gb.GRB.BINARY, name=f"z_{t}")

        # 输出
        y = m.addVar(lb=-gb.GRB.INFINITY, name=f"y_{t}")
        y_trees1.append(y)

        # ========= 1. 选择一个叶子 =========
        m.addConstr(z.sum() == 1)

        # ========= 2. 区间约束（核心tight约束）=========
        for i in range(n_features):
            m.addConstr(
                sum((leaves[l][1][i]) * z[l] for l in range(Len)) >= input_vars[i]
            )

            m.addConstr(
                sum(leaves[l][0][i] * z[l] for l in range(Len)) <= input_vars[i]
            )

        # ========= 3. 输出 =========
        m.addConstr(
            y == sum(leaves[l][2] * z[l] for l in range(Len))
        )

    # ========= 4. 汇总 =========
    m.addConstr(fop == gb.quicksum(y_trees1) + base_score)

    end_time = time.time()
    elapsed = end_time - start_time
    print(f"嵌入1耗时: {elapsed:.2f} 秒")
    return fop

load_biggs(m,fop)
#===========================================================================

# pred_constr1 = add_predictor_constr(m, model, input_vars)
# pred_sales1 = pred_constr1.output
# m.addConstr(pred_sales1==fop)
m.setObjective(2, gb.GRB.MINIMIZE)
m.optimize()
if m.status != gb.GRB.OPTIMAL:
    print(m.status)

print(fop.X)
print(m.ObjVal)